title: Windows Defender Disabled
id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
status: experimental
description: Windows Defender logs when it is disabled.
author: Cian Heasley
reference:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
date: 2020/08/13
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    category: antivirus
    product: Microsoft Windows Defender
detection:
    selection:
        EventID: 1151
        RTP_state: 'Disabled'
        IOAV_state: 'Disabled'
        OA_state: 'Disabled'
        BM_state: 'Disabled'
    condition: selection
fields:
    - EventID
    - RTP_state
    - IOAV_state
    - OA_state
    - BM_state
falsepositives:
    - Disabling of Defender for legitimate reasons
level: medium
